/*
	-----------------------------------------------------------------------------------------
	----Вычислить длину вектора с координатами x,y,z
	double dX = 0.0, dY = 0.0, dZ = 0.0;
	cout << "Введите X: ";
	cin >> dX;
	cout << "\nВведите Y: ";
	cin >> dY;
	cout << "\nВведите Z: ";
	cin >> dZ;

	double dVectorLength = sqrt(dX * dX + dY * dY + dZ * dZ);
	cout << "\nДлина вектора = " << dVectorLength << endl;
	-----------------------------------------------------------------------------------------


	-----------------------------------------------------------------------------------------
	---Деление числа на разряды
		int number;
	cout << "\n\t\tДеление числа на разряды";
	cout << "\nВведите пятизначное число: ";
	cin >> number;

	int n1 = number % 100000 / 10000;
	int n2 = number % 10000 / 1000;
	int n3 = number % 1000 / 100;
	int n4 = number % 100 / 10;
	int n5 = number % 10;
	cout << "\n1 цифра равна " << n1;
	cout << "\n2 цифра равна " << n2;
	cout << "\n3 цифра равна " << n3;
	cout << "\n4 цифра равна " << n4;
	cout << "\n5 цифра равна " << n5;

	 ==================================================================================
								UPDATE
								int number;
	cout << "\n\t\tДеление числа на разряды";
	cout << "\nВведите пятизначное число: ";
	cin >> number;
	cout << "\n";
	if (number >= 0 && number <= 9999) {
		cout << "Ваше число меньше пятизначного. Число доолжно быть пятизначным\n\n";
	}
	else {
		if (number >= 100000) {
			cout << "Ваше число больше пятизначного. Число должно быть пятизначным\n\n";
		 }
		else {
			cout << "\n1 цифра равна " << number % 100000 / 10000;
			cout << "\n2 цифра равна " << number % 10000 / 1000;
			cout << "\n3 цифра равна " << number % 1000 / 100;
			cout << "\n4 цифра равна " << number % 100 / 10;
			cout << "\n5 цифра равна " << number % 10;
		}
	}
	 ============================================================================
	-----------------------------------------------------------------------------------------

	----------------------------------------------------------------------------------------

	Просто математическое выражение

	int a, b, c;
	cout << "Введите цифры a, b, c:\n";
	cout << "a=";
	cin >> a;
	cout << "b=";
	cin >> b;
	cout << "c=";
	cin >> c;
	cout << "\nВычисляем по формуле: x=(a + b - c / a) + c * a * a - (a + b)";
	double x = (a + b - c / a) + c * a * a - (a + b);
	cout << "\nx=" << x;
	-------------------------------------------------------------------------------------------
*/