/*
* -----------------------------------------------------------
* ========Большая и меньшая цифра числа
		int num, n1, n2;
	cout << "\t\t\tБольшая и меньшая цифры числа\n";
	cout << "Введите число не большее 99: ";
	cin >> num;
	if (num >= 100) {
		cout << "Пожалуйста, введите двузначное число\n";
	}
	else {
		n1 = num / 10 % 10;
		n2 = num % 10;
		if (n1 > n2) {
			cout << n1 << " - Большая цифра\n";
			cout << n2 << " - Меньшая цифра\n";
		}
		else {
			cout << n2 << " - Большая цифра\n";
			cout << n1 << " - Меньшая цифра\n";
		} 
		else {
			if(n1 == 2n) {
				cout << "Числа равны";
			}
		}
	}
	-----------------------------------------------------------

	-----------------------------------------------------------
	============угл
		double V, T, param, result;
	const double Pi = asin(1.0), g = 9.8;
	std::cout << " V = ";
	std::cin >> V;

	std::cout << std::endl << " T = ";
	std::cin >> T;

	if (1 < fabs(g * T / (2 * V)))
		std::cout << "Incorrect" << std::endl;
	else
	{
		param = asin(g * T / (2 * V));
		std::cout << "Ugol = " << param * (90 / Pi) << std::endl;
	}
	-----------------------------------------------------------
*/