/*
* -----------------------------------------------------------
* ========Большая и меньшая цифра числа
		int num, n1, n2;
	cout << "\t\t\tБольшая и меньшая цифры числа\n";
	cout << "Введите число не большее 99: ";
	cin >> num;
	if (num >= 100) {
		cout << "Пожалуйста, введите двузначное число\n";
	}
	else {
		n1 = num / 10 % 10;
		n2 = num % 10;
		if (n1 > n2) {
			cout << n1 << " - Большая цифра\n";
			cout << n2 << " - Меньшая цифра\n";
		}
		else {
			cout << n2 << " - Большая цифра\n";
			cout << n1 << " - Меньшая цифра\n";
		} 
		else {
			if(n1 == 2n) {
				cout << "Числа равны";
			}
		}
	}
	-----------------------------------------------------------
*/